app/views/messages/_message.html.erb

  <p>
    <small><em>Created <%= time_ago_in_words(message.created_at) %> ago</em></small>
---
INSERT INTO "messages" ("content", "chef_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello"], ["chef_id", 2], ["created_at", "2018-06-01 09:33:14.512956"], ["updated_at", "2018-06-01 09:33:14.512956"]]