app/views/comments/_comment.html.erb

    <p>
      <span class="quiet"><small>Created: <%= time_ago_in_words(comment.created_at) %> ago by <%= comment.chef.chefname %></small></span>
---
INSERT INTO "comments" ("description", "chef_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "test real time"], ["chef_id", 2], ["recipe_id", 11], ["created_at", "2018-06-01 06:48:24.511021"], ["updated_at", "2018-06-01 06:48:24.511021"]]