app/views/chefs/show.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = $1  [["chef_id", 2]]
---
</div>
<% if @chef.recipes.count != 0 %>