app/views/recipes/_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
          <div class="col-md-offset-2 col-md-8">
          <%= f.collection_check_boxes :ingredient_ids,Ingredient.all, :id, :name do |cb| %>