app/views/recipes/_recipe.html.erb

      <p><%= truncate(recipe.description, length: 150) %></p>
      <% if recipe.ingredients.any? %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 7]]
SELECT  1 AS one FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1 LIMIT $2  [["recipe_id", 7], ["LIMIT", 1]]


        <%= time_ago_in_words(recipe.created_at) %> ago by <%= recipe.chef.chefname.capitalize %>| <%= pluralize(recipe.comments.count, 'comment') %></small></span>
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 11]]