app/views/ingredients/index.html.erb

          <li class="chef-title"><%= link_to ing.name.capitalize, ingredient_path(ing) %></li>
          <li><small><%= pluralize(ing.recipes.count,"recipe") if ing.recipes %></small></li>
---
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = $1  [["ingredient_id", 1]]