app/views/ingredients/show.html.erb

<%= render 'shared/page_title', title: "#{@ingredient.name}" %>
<% if @ingredient.recipes.count != 0 %>
---
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = $1  [["ingredient_id", 1]]