app/controllers/application_controller.rb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def current_chef
    @current_chef ||= Chef.find(session[:chef_id]) if session[:chef_id]