app/controllers/chefs_controller.rb

  def show
    @chef_recipes = @chef.recipes.paginate(page:params[:page], per_page: 5)#phantrang
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = $1 ORDER BY "recipes"."updated_at" DESC  [["chef_id", 1]]