app/controllers/chefs_controller.rb

  def index
    #@chefs = Chef.all
    @chefs = Chef.paginate(page: params[:page],per_page: 5)
---
SELECT  "chefs".* FROM "chefs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "chefs"

  def create
    @chef = Chef.new(chef_params)
    if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @chef_recipes = @chef.recipes.paginate(page:params[:page], per_page: 5)#phantrang
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2 OFFSET $3  [["chef_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = $1  [["chef_id", 1]]

  def update
    if @chef.update(chef_params)
---
UPDATE "chefs" SET "password_digest" = $1, "updated_at" = $2 WHERE "chefs"."id" = $3  [["password_digest", "$2a$10$Mn/gbT3yIQvI0jbAf0aANupaEgzY.YbISf3uwaicPnBcBC97e71j6"], ["updated_at", "2018-05-31 14:23:19.806251"], ["id", 2]]

  def destroy
    @chef.destroy
---
DELETE FROM "chefs" WHERE "chefs"."id" = $1  [["id", 1]]

  def set_chef
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]