app/controllers/chefs_controller.rb

  def show
    @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]