app/controllers/comments_controller.rb

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @comment = @recipe.comments.build(comment_params)
    @comment.chef = current_chef
    if @comment.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "comments" ("description", "chef_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "trying again"], ["chef_id", 2], ["recipe_id", 11], ["created_at", "2018-06-01 02:57:12.598147"], ["updated_at", "2018-06-01 02:57:12.598147"]]