app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.new(ingredient_params)
    if @ingredient.save
---
INSERT INTO "ingredients" ("name") VALUES ($1) RETURNING "id"  [["name", "hung"]]

  def update
    if @ingredient.update(ingredient_params)
---
UPDATE "ingredients" SET "name" = $1 WHERE "ingredients"."id" = $2  [["name", "carrots edited"], ["id", 2]]

  def show
   @ingredient_recipes = @ingredient.recipes.paginate(page:params[:page], per_page: 5)#phantrang
---
SELECT  "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2 OFFSET $3  [["ingredient_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = $1  [["ingredient_id", 1]]

  def index
    @ingredients = Ingredient.paginate(page: params[:page], per_page: 5)
---
SELECT  "ingredients".* FROM "ingredients" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "ingredients"

  def set_ingredient
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]