app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "chef_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "new message"], ["chef_id", 2], ["created_at", "2018-06-01 09:04:21.304698"], ["updated_at", "2018-06-01 09:04:21.304698"]]
---
  def create
    @message = Message.new(message_params)
    @message.chef = current_chef
    if @message.save