app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."published" = $1  [["published", true]]
---
  def index
    @products = Product.where(published: nil)

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

SELECT "categories".* FROM "categories"
INSERT INTO "products" ("title", "description", "created_at", "updated_at", "price", "category_id", "country") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "aa"], ["description", "aaa"], ["created_at", "2018-05-24 02:48:53.769721"], ["updated_at", "2018-05-24 02:48:53.769721"], ["price", "2.0"], ["category_id", 1], ["country", "BH"]]
---
  def create
    @product = Product.new(product_params)
    @categories = Category.all
    # if @product.save
    #   # redirect_to products_url
    #   flash[:notice] = 'successfully'
    #   redirect_to products_url

    # else
    #   flash.now[:notice] = 'Error'
    #   render :new
    # end
    return redirect_to products_url, notice: 'you have successfully create product' if @product.save

UPDATE "products" SET "description" = $1, "country" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["description", "bb"], ["country", "AF"], ["updated_at", "2018-05-24 03:05:31.361547"], ["id", 4]]
---
  def update
    #@product = Product.find(params[:id])
    return redirect_to products_url, notice: 'you have successfully update product' if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 2]]
---
  def destroy
    return redirect_to products_url, notice: 'you have successfully delete product' if @product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def get_product
    @product = Product.find(params[:id])