app/controllers/recipes_controller.rb

  def index
    #@recipes = Recipe.all
    @recipes = Recipe.paginate(page: params[:page], per_page: 5)
---
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."updated_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.first
    if @recipe.save
---
SELECT  "chefs".* FROM "chefs" ORDER BY "chefs"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "chef_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ga"], ["description", "ga ngon"], ["created_at", "2018-05-31 02:04:10.765908"], ["updated_at", "2018-05-31 02:04:10.765908"], ["chef_id", 2]]

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "description" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["description", "fksmfaa"], ["updated_at", "2018-05-28 15:49:13.747612"], ["id", 8]]

  def destroy
    Recipe.find(params[:id]).destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 8]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."updated_at" DESC LIMIT $2  [["id", 6], ["LIMIT", 1]]