app/controllers/recipes_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1 ORDER BY "comments"."updated_at" DESC LIMIT $2 OFFSET $3  [["recipe_id", 11], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 11]]
---
  def show
    @comment = Comment.new
    @comments = @recipe.comments.paginate(page: params[:page],per_page: 5)