app/controllers/sessions_controller.rb

  def create
    chef = Chef.find_by(email: params[:session][:email].downcase)
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."email" = $1 LIMIT $2  [["email", "hung@gmail.com"], ["LIMIT", 1]]