app/models/message.rb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT $1  [["LIMIT", 20]]
---
  def self.most_recent
    order(:created_at).last(20)