app/views/layouts/_navigation.html.erb

            <li><%= link_to "All Ingredients", ingredients_path%></li>
            <% Ingredient.all.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients"